tap "homebrew/cask"
tap "buo/cask-upgrade"
brew "mas"

tap "homebrew/bundle"
tap "homebrew/core"
tap "robotsandpencils/made"
tap "homebrew/cask-fonts"
# work
brew "asdf"
brew "aria2"
brew "bat"
brew "cloc"
brew "exa"
brew "gnutls"
brew "gh"
brew "gnupg"
brew "jq"
brew "llvm"
brew "pinentry-mac"
brew "swiftlint"
brew "tree"
brew "wget"
brew "robotsandpencils/made/xcodes"
brew "diff-so-fancy"
brew "git-delta"
brew "mint"
cask "apparency"
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "rectangle"
cask "suspicious-package"
cask "visual-studio-code"
cask "keycastr"
cask "xcodes"
# quit apple music from opening
cask "overkill"
mas "BBEdit", id: 404009241
mas "Color Picker", id: 1545870783
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Drafts", id: 1435957248
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Front and Center", id: 1493996622
mas "Hush", id: 1544743900
mas "Home Assistant", id: 1099568401
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "Magic Lasso", id: 1198047227
mas "PiPifier", id: 1160374471
mas "Refined GitHub", id: 1519867270
mas "Tweetbot", id: 1384080005
mas "Userscripts", id: 1463298887
mas "UTC Time", id: 1538245904
mas "Zavala", id: 1546457750

